/**
  ******************************************************************************
  * @file    test.c
  * @author  ShiYaoming
  * @version V1.0
  * @date    2025-09-04
  * @brief   提供各模块的测试程序
  ******************************************************************************
  * @attention
  *   拷贝请注明来处。
  ******************************************************************************
  */
#include "test.h"


/**********************************************************************
 * 函数名称： VoltageOfBattery_Test
 * 功能描述： 测量电池电压的测试程序
 * 输入参数： 无
 * 输出参数： 无
 *            无
 * 返 回 值： 无
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2025/09/04        V1.0     shiyaoming         创建
 ***********************************************************************/
void VoltageOfBattery_Test(void)
{
	float value;
	
	ADC_Config();
	
	while(1)
	{
		  value = Get_VoltageOfBattery();
			printf("%.2f\n",value);             //必须在数据后跟一个'\n',否则上位机无法解析到数据
			mdelay(10);
	}
	
}



